// *++
//
// Copyright (c) 2006, Intel Corporation
// All rights reserved. This program and the accompanying materials
// are licensed and made available under the terms and conditions of the BSD License
// which accompanies this distribution.  The full text of the license may be found at
// http://opensource.org/licenses/bsd-license.php
//
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.
//
// Module Name:
//
//   SetupBrowserStr.uni
//
// Abstract:
//
//   String definitions for Browser.
//
// --*/


/=#

#langdef eng "English"
#langdef fra "Français"

#string HOME_PAGE_TITLE                #language eng  "Setup Interpreter"
                                       #language fra  "Interprète d'organisation"
#string HOME_ESCAPE_STRING             #language eng  "Esc=Exit Interpreter"
                                       #language fra  "Esc=l'Interprète de sortie"
#string FUNCTION_ONE_STRING            #language eng  "F1=Scroll Help"
                                       #language fra  "F1=Scroll Aide"
#string FUNCTION_TWO_STRING            #language eng  "F2=Previous Page"
                                       #language fra  "F2=Previous Page"
#string FUNCTION_NINE_STRING           #language eng  "F9=Reset to Defaults"
                                       #language fra  "F9=Reset à Défauts"
#string FUNCTION_TEN_STRING            #language eng  "F10=Save"
                                       #language fra  "F10=Save"
#string ENTER_STRING                   #language eng  "<Enter>=Select Entry"
                                       #language fra  "<Enter>=Choisir l'Entrée"
#string ENTER_COMMIT_STRING            #language eng  "<Enter>=Complete Entry"
                                       #language fra  "<Enter>=Compléter l'Entrée"
#string ESCAPE_STRING                  #language eng  "Esc=Discard Changes"
                                       #language fra  "Esc=rejette des Changements"
#string ADJUST_NUMBER                  #language eng  "+/- =Adjust Value"
                                       #language fra  "+/- =rejette des Changements"
#string PLUS_STRING                    #language eng  "+ = Move Selection Up"
                                       #language fra  "+ = rejette des Changements"
#string MINUS_STRING                   #language eng  "- = Move Selection Down"
                                       #language fra  "- = rejette des Changements"
#string MOVE_HIGHLIGHT                 #language eng  "=Move Highlight"
                                       #language fra  "=Essentiel de mouvement"
#string MAKE_SELECTION                 #language eng  " =Select From Choices"
                                       #language fra  " =Choisir des Choix"
#string NUMERIC_INPUT                  #language eng  "0123456789 are valid inputs"
                                       #language fra  "0123456789 sont des données valides"
#string TOGGLE_CHECK_BOX               #language eng  "<Spacebar>Toggle Checkbox"
                                       #language fra  "<Spacebar>Bascule la Case de pointage"
#string PROMPT_FOR_PASSWORD            #language eng  "Please type in your password"
                                       #language fra  "S'il vous plaît tape votre mot de passe"
#string PROMPT_FOR_NEW_PASSWORD        #language eng  "Please type in your new password"
                                       #language fra  "S'il vous plaît tape votre nouveau mot de passe"
#string CONFIRM_PASSWORD               #language eng  "Please confirm your new password"
                                       #language fra  "S'il vous plaît confirmer votre nouveau mot de passe"
#string CONFIRM_ERROR                  #language eng  "Passwords are not the same"
                                       #language fra  "Les mots de passe ne sont pas pareils"
#string PRESS_ENTER                    #language eng  "Press ENTER to continue"
                                       #language fra  "La presse ENTRE continuer"
#string PROMPT_FOR_DATA                #language eng  "Please type in your data"
                                       #language fra  "S'il vous plaît tape vos données"
#string NV_UPDATE_MESSAGE              #language eng  "NV"
                                       #language fra  "NV"
#string INPUT_ERROR_MESSAGE            #language eng  "!!"
                                       #language fra  "!!"
#string EMPTY_STRING                   #language eng  ""
                                       #language fra  ""
#string ARE_YOU_SURE                   #language eng  "Are you sure? (Y/N)"
                                       #language fra  "Are you sure? (Y/N)"
#string ARE_YOU_SURE_YES               #language eng  "Y"
				       												 #language fra  "Y"
#string ARE_YOU_SURE_NO		       			 #language eng  "N"
				       									 			 #language fra  "N"
#string MINI_STRING                    #language eng  "Please enter enough characters"
                                       #language fra  "Please enter enough characters"